In [1]:
import numpy as np

In [2]:
myArray1 = np.random.rand(50)

In [3]:
myArray1

array([0.17565828, 0.24910482, 0.04938233, 0.89637791, 0.77580414,
       0.1373156 , 0.42676528, 0.9659143 , 0.38912486, 0.41012107,
       0.87373066, 0.66940069, 0.01266645, 0.8594707 , 0.20334564,
       0.5582566 , 0.36773622, 0.12704246, 0.34936671, 0.36460261,
       0.84306015, 0.27037621, 0.44740493, 0.16031416, 0.34963241,
       0.90389398, 0.58289728, 0.80834815, 0.97742981, 0.96123213,
       0.14146812, 0.17504493, 0.99719333, 0.05974147, 0.53663522,
       0.96094416, 0.84000156, 0.29310085, 0.45419733, 0.83413299,
       0.19292894, 0.32529362, 0.84781964, 0.51009051, 0.88668771,
       0.21057037, 0.80459377, 0.69069962, 0.45958625, 0.20208238])

In [4]:
myArray1 = 10*np.random.rand(50)

In [5]:
myArray1

array([4.25221297, 7.07775568, 5.47267523, 8.69157075, 5.11176832,
       5.66803675, 0.09225584, 4.38050461, 7.56969904, 3.02070015,
       5.85886999, 9.41577072, 8.02152309, 4.9550313 , 4.55769238,
       1.3059769 , 6.12762665, 4.39969716, 8.77185452, 8.04688975,
       3.98688799, 3.6945464 , 1.04643958, 1.7963101 , 5.07513684,
       6.09336084, 6.42311318, 7.4706374 , 7.75478948, 8.53216839,
       7.26545967, 1.07187356, 4.45152261, 1.06013483, 7.82229391,
       2.35474205, 0.45700189, 2.75749118, 7.78921711, 9.69200984,
       2.31861338, 3.60845985, 8.11807802, 2.32164178, 7.54362572,
       7.2921425 , 2.72802451, 0.78828982, 8.5309811 , 4.39406709])

In [6]:
np.floor(myArray1)

array([4., 7., 5., 8., 5., 5., 0., 4., 7., 3., 5., 9., 8., 4., 4., 1., 6.,
       4., 8., 8., 3., 3., 1., 1., 5., 6., 6., 7., 7., 8., 7., 1., 4., 1.,
       7., 2., 0., 2., 7., 9., 2., 3., 8., 2., 7., 7., 2., 0., 8., 4.])

In [7]:

myArray2 = myArray1 > 5

In [8]:
myArray2

array([False,  True,  True,  True,  True,  True, False, False,  True,
       False,  True,  True,  True, False, False, False,  True, False,
        True,  True, False, False, False, False,  True,  True,  True,
        True,  True,  True,  True, False, False, False,  True, False,
       False, False,  True,  True, False, False,  True, False,  True,
        True, False, False,  True, False])

In [9]:
myArray2 = myArray1[myArray1 > 5]

In [10]:
myArray2

array([7.07775568, 5.47267523, 8.69157075, 5.11176832, 5.66803675,
       7.56969904, 5.85886999, 9.41577072, 8.02152309, 6.12762665,
       8.77185452, 8.04688975, 5.07513684, 6.09336084, 6.42311318,
       7.4706374 , 7.75478948, 8.53216839, 7.26545967, 7.82229391,
       7.78921711, 9.69200984, 8.11807802, 7.54362572, 7.2921425 ,
       8.5309811 ])

In [11]:
myArray2.sort()

In [12]:
myArray2

array([5.07513684, 5.11176832, 5.47267523, 5.66803675, 5.85886999,
       6.09336084, 6.12762665, 6.42311318, 7.07775568, 7.26545967,
       7.2921425 , 7.4706374 , 7.54362572, 7.56969904, 7.75478948,
       7.78921711, 7.82229391, 8.02152309, 8.04688975, 8.11807802,
       8.5309811 , 8.53216839, 8.69157075, 8.77185452, 9.41577072,
       9.69200984])

In [13]:
np.sort(myArray2)

array([5.07513684, 5.11176832, 5.47267523, 5.66803675, 5.85886999,
       6.09336084, 6.12762665, 6.42311318, 7.07775568, 7.26545967,
       7.2921425 , 7.4706374 , 7.54362572, 7.56969904, 7.75478948,
       7.78921711, 7.82229391, 8.02152309, 8.04688975, 8.11807802,
       8.5309811 , 8.53216839, 8.69157075, 8.77185452, 9.41577072,
       9.69200984])

In [14]:
myArray1.sort()

In [15]:
myArray1 = myArray1[::-1]

In [16]:
myArray1

array([9.69200984, 9.41577072, 8.77185452, 8.69157075, 8.53216839,
       8.5309811 , 8.11807802, 8.04688975, 8.02152309, 7.82229391,
       7.78921711, 7.75478948, 7.56969904, 7.54362572, 7.4706374 ,
       7.2921425 , 7.26545967, 7.07775568, 6.42311318, 6.12762665,
       6.09336084, 5.85886999, 5.66803675, 5.47267523, 5.11176832,
       5.07513684, 4.9550313 , 4.55769238, 4.45152261, 4.39969716,
       4.39406709, 4.38050461, 4.25221297, 3.98688799, 3.6945464 ,
       3.60845985, 3.02070015, 2.75749118, 2.72802451, 2.35474205,
       2.32164178, 2.31861338, 1.7963101 , 1.3059769 , 1.07187356,
       1.06013483, 1.04643958, 0.78828982, 0.45700189, 0.09225584])

In [17]:
np.sort(myArray1)

array([0.09225584, 0.45700189, 0.78828982, 1.04643958, 1.06013483,
       1.07187356, 1.3059769 , 1.7963101 , 2.31861338, 2.32164178,
       2.35474205, 2.72802451, 2.75749118, 3.02070015, 3.60845985,
       3.6945464 , 3.98688799, 4.25221297, 4.38050461, 4.39406709,
       4.39969716, 4.45152261, 4.55769238, 4.9550313 , 5.07513684,
       5.11176832, 5.47267523, 5.66803675, 5.85886999, 6.09336084,
       6.12762665, 6.42311318, 7.07775568, 7.26545967, 7.2921425 ,
       7.4706374 , 7.54362572, 7.56969904, 7.75478948, 7.78921711,
       7.82229391, 8.02152309, 8.04688975, 8.11807802, 8.5309811 ,
       8.53216839, 8.69157075, 8.77185452, 9.41577072, 9.69200984])

In [18]:
array3 = np.sort(myArray1)

In [19]:
array3 = array3[::-1]

In [20]:
array3

array([9.69200984, 9.41577072, 8.77185452, 8.69157075, 8.53216839,
       8.5309811 , 8.11807802, 8.04688975, 8.02152309, 7.82229391,
       7.78921711, 7.75478948, 7.56969904, 7.54362572, 7.4706374 ,
       7.2921425 , 7.26545967, 7.07775568, 6.42311318, 6.12762665,
       6.09336084, 5.85886999, 5.66803675, 5.47267523, 5.11176832,
       5.07513684, 4.9550313 , 4.55769238, 4.45152261, 4.39969716,
       4.39406709, 4.38050461, 4.25221297, 3.98688799, 3.6945464 ,
       3.60845985, 3.02070015, 2.75749118, 2.72802451, 2.35474205,
       2.32164178, 2.31861338, 1.7963101 , 1.3059769 , 1.07187356,
       1.06013483, 1.04643958, 0.78828982, 0.45700189, 0.09225584])

In [21]:
x = np.array([('Permanent',31,'1990',5000),('Non-Permanent',24,'1997',25000),('Permanent',36,'1985',50000)],
               dtype = [('EmployeeType', 'U20'),('Age','i8'),('BirthYear','U10'),('Salary', 'i8')])

In [22]:
x['Age']

x['EmployeeType']

x['Salary']

x['BirthYear']

array(['1990', '1997', '1985'], dtype='<U10')

In [23]:
import pandas as pd

In [27]:
name = {'A': 'Alan', 'B':'John','C':'Cindy', 'D': 'Stacy', 'I':'Isiaka', 'E':'Diana'}

Vaccinated = {'A': 'True', 'B':'False', 'C':'False', 'D':'True','I':'True', 'E':'False'}

Country = {'A':'Pakistan', 'B':'China', 'C':'Pakistan','D':'China','I':'Pakistan','E':'China'}

D = pd.DataFrame({'Names':name,'vaccined':Vaccinated, 'country':Country})
D

    Names vaccined   country
A    Alan     True  Pakistan
B    John    False     China
C   Cindy    False  Pakistan
D   Stacy     True     China
I  Isiaka     True  Pakistan
E   Diana    False     China

In [28]:
D.groupby([D.country]).sum()

                    Names        vaccined
country
China      JohnStacyDiana  FalseTrueFalse
Pakistan  AlanCindyIsiaka   TrueFalseTrue

In [30]:
#D.groupby([D.country]).mean()

In [27]:
D.values

array([['Alan', 'True'],
       ['John', 'False'],
       ['Cindy', 'False'],
       ['Stacy', 'True'],
       ['Isiaka', 'True'],
       ['Diana', 'False']], dtype=object)

In [29]:
D.values[4,0]

'Isiaka'

In [30]:
K = D[D['vaccined']== 'True']

In [31]:
K

    Names vaccined
A    Alan     True
D   Stacy     True
I  Isiaka     True

In [32]:
N = D[D['vaccined']== 'False']

In [33]:
N

   Names vaccined
B   John    False
C  Cindy    False
E  Diana    False

In [33]:
df = pd.DataFrame({'A':np.random.randint(0,13,5),
                  'B':np.random.randint(0,13,5),
                  'C':np.random.randint(0,13,5)})

In [34]:
df

   A   B  C
0  3  10  9
1  4   2  8
2  8   8  6
3  2   3  8
4  1   6  0

In [35]:
df.rolling(3,min_periods=1).sum()

      A     B     C
0   3.0  10.0   9.0
1   7.0  12.0  17.0
2  15.0  20.0  23.0
3  14.0  13.0  22.0
4  11.0  17.0  14.0

In [36]:
df.rolling(3,min_periods=1).mean()

          A          B         C
0  3.000000  10.000000  9.000000
1  3.500000   6.000000  8.500000
2  5.000000   6.666667  7.666667
3  4.666667   4.333333  7.333333
4  3.666667   5.666667  4.666667